{"ologies":[
	{"name":"Abiology", "field":"The study of inanimate, inorganic, or lifeless things."},
	{"name":"Acanthochronology", "field":"The study of cactus spines or euphorbia thorns grown in time ordered sequence."},
	{"name":"Acanthology", "field":"The study of spined things, in particular sea urchins, and the resultant impact on taxonomy."},
	{"name":"Acarology", "field":"The study of mites and ticks."},
	{"name":"Accentology", "field":"The systematic analysis of word or phrase stress and accentuation in language."},
	{"name":"Aceology", "field":"The science of remedies or therapeutics."},
	{"name":"Acology", "field":"The science of medical remedies, Materia Medica."},
	{"name":"Acridology", "field":"The study of grasshoppers and locusts (infraorder Acrididea)."},
	{"name":"Acropathology", "field":"The study of diseases affecting limbs."},
	{"name":"Actinobiology", "field":"The study of the effects of radiation upon living organisms."},
	{"name":"Actinology", "field":"The study of the effect of light on chemicals."},
	{"name":"Adenology", "field":"The branch of medicine dealing with the development, structure, function, and diseases of glands."},
	{"name":"Aedoeology", "field":"The study of human genitalia."},
	{"name":"Aerobiology", "field":"A branch of biology that studies organic particles, such as bacteria, fungal spores, very small insects, pollen grains and viruses, which are passively transported by the air."},
	{"name":"Aerogeology", "field":"The study of geological features by aerial observation and aerophotography."},
	{"name":"Aerolithology", "field":"The study of meteorites."},
	{"name":"Aerology", "field":"The branch of meteorology involving the observation of the atmosphere by means of balloons, airplanes, etc."},
	{"name":"Aeropalynology", "field":"The study of pollen grains and spores (palynomorphs) in the atmosphere."},
	{"name":"Aetiology", "field":"The study of causes or causation."},
	{"name":"Agathology", "field":"The science or theory of the good or goodness."},
	{"name":"Agmatology", "field":"The branch of medical science that studies fractures."},
	{"name":"Agnoiology", "field":"The study of things of which humans are by nature ignorant, or of things which cannot be known."},
	{"name":"Agnotology", "field":"The study of culturally induced ignorance or doubt, particularly the publication of inaccurate or misleading scientific data."},
	{"name":"Agriology", "field":"The comparative study of primitive, illiterate or 'savage' cultures."},
	{"name":"Agrobiology", "field":"The science of plant nutrition and growth in relation to soil conditions, especially to determine ways to increase crop yields."},
	{"name":"Agroclimatology", "field":"The study of meteorological, climatological, and hydrological conditions which are significant for agriculture owing to their interaction with the objects and process of agriculture production."},
	{"name":"Agroecology", "field":"The study of ecological processes that operate in agricultural production systems."},
	{"name":"Agrogeology", "field":"The study of the origins of minerals known as agrominerals and their applications."},
	{"name":"Agrology", "field":"The science and art of agriculture."},
	{"name":"Agrometeorology", "field":"The study of weather and use of weather and climate information to enhance or expand agricultural crops and/or to increase crop production."},
	{"name":"Agrostology", "field":"The scientific study of the grasses (family Poaceae)."},
	{"name":"Agrotechnology", "field":"The application of modern technology to agriculture."},
	{"name":"Aitiology", "field":"The study of causation, or origination."},
	{"name":"Alethiology", "field":"The study of the nature of truth or aletheia."},
	{"name":"Algology", "field":"The branch of botany dealing with algae."},
	{"name":"Alimentology", "field":"The study of nutrition."},
	{"name":"Allergology", "field":"The study of the causes and treatment of allergies."},
	{"name":"Alphabetology", "field":"The study of alphabetic systems of writing."},
	{"name":"Amphibiology", "field":"The branch of zoology that deals with the class Amphibia."},
	{"name":"Anaplastology", "field":"The branch of medicine dealing with the prosthetic rehabilitation of an absent, disfigured or malformed anatomically critical location of the face or body."},
	{"name":"Anarcheology", "field":"The study of how people throughout history have progressed and thrived with limited government (minarchy) or with no government at all."},
	{"name":"Anatripsology", "field":"The study of friction as a remedy in medicine."},
	{"name":"Andrology", "field":"The medical specialty that deals with male health, particularly relating to the problems of the male reproductive system and urological problems that are unique to men."},
	{"name":"Anemology", "field":"The study of wind."},
	{"name":"Anesthesiology", "field":"The study of anesthesia and anesthetics."},
	{"name":"Angelology", "field":"The study of angels."},
	{"name":"Angiology", "field":"The study of the anatomy of blood and lymph vascular systems."},
	{"name":"Angiopathology", "field":"The pathology of diseased blood vessels."},
	{"name":"Anthoecology", "field":"The branch of ecology that studies the relationship of flowers to their environment."},
	{"name":"Anthropobiology", "field":"The study of the biologic relationships of humans as a species."},
	{"name":"Anthropology", "field":"The holistic scientific and social study of humanity, mainly using ethnography as its method."},
	{"name":"Anthroposociology", "field":"The anthropological and sociological study of race as a means of establishing the superiority of certain peoples."},
	{"name":"Anthrozoology", "field":"The study of the interactions between humans and animals."},
	{"name":"Aphasiology", "field":"The study of linguistic problems or aphasias resulting from brain damage."},
	{"name":"Aphnology", "field":"The study of wealth."},
	{"name":"Apicology", "field":"The study of honey bee ecology."},
	{"name":"Apiology", "field":"The scientific study of honey bees and honey-making."},
	{"name":"Arachnology", "field":"The scientific study of spiders and related animals such as scorpions, pseudoscorpions, and harvestmen, collectively called arachnids."},
	{"name":"Araneology", "field":"The branch of arachnology that deals with spiders."},
	{"name":"Archeogeology", "field":"The branch of geology that studies the geological formations of the past."},
	{"name":"Archeology", "field":"The study of human activity through the recovery and analysis of material culture."},
	{"name":"Archeozoology", "field":"The study of faunal remains or the items left behind when an animal dies."},
	{"name":"Archology", "field":"The study of the science of governance or the origin of things."},
	{"name":"Areology", "field":"The study of the planet Mars' geology."},
	{"name":"Aretology", "field":"The part of moral philosophy which treats of virtue, its nature, and the means of attaining to it."},
	{"name":"Aristology", "field":"The art or study of cooking and dining."},
	{"name":"Arkeology", "field":"The study of the story of Noah's Ark, particularly the search for physical evidence which would corroborate it."},
	{"name":"Armenology", "field":"The study of Armenian history, language, and culture."},
	{"name":"Arteriology", "field":"The branch of angiology dealing with arteries."},
	{"name":"Arthrology", "field":"The branch of anatomy dealing with joints."},
	{"name":"Arthropathology", "field":"The study of functional and structural changes made by diseases of the joints."},
	{"name":"Arthropodology", "field":"The study of arthropods."},
	{"name":"Assyriology", "field":"The study of the Assyrians."},
	{"name":"Astacology", "field":"The study of crayfish."},
	{"name":"Astheniology", "field":"The study of diseases of weakening and aging."},
	{"name":"Asthmology", "field":"The study of asthma."},
	{"name":"Astroarcheaology", "field":"The study of astronomical knowledge of prehistoric cultures; archaeoastronomy."},
	{"name":"Astrobiology", "field":"The study of the origin, evolution, distribution, and future of life in the universe: extraterrestrial life and life on Earth."},
	{"name":"Astrogeology", "field":"The science dealing with the structure and composition of planets and other bodies in the solar system."},
	{"name":"Astrolithology", "field":"The study of aerolites."},
	{"name":"Astrology", "field":"The study of the movements and relative positions of celestial objects as a means for divining information about human affairs and terrestrial events."},
	{"name":"Astrometeorology", "field":"The study of the theoretical effects of astronomical bodies and forces on the Earth’s atmosphere."},
	{"name":"Astroseismology", "field":"The study of oscillations in stars."},
	{"name":"Atheology", "field":"The study of Atheism"},
	{"name":"Atmology", "field":"The branch of science dealing with the laws and phenomena of aqueous vapour."},
	{"name":"Atmospherology", "field":"The study of a planetary atmosphere."},
	{"name":"Atomology", "field":"The study or doctrine of atoms."},
	{"name":"Audiology", "field":"The study of the auditory and vestibular systems, and associated disorders."},
	{"name":"Autecology", "field":"One of two broad subdivisions of ecology, which studies the individual organism or species."},
	{"name":"Autology", "field":"The study of oneself."},
	{"name":"Autonumerology", "field":"The study of unusual license plates."},
	{"name":"Auxanology", "field":"The study of growth."},
	{"name":"Auxology", "field":"The study of growth."},
	{"name":"Axiology", "field":"The philosophical study of value."},
	{"name":"Azoology", "field":"The study of inanimate nature."},
	{"name":"Bacteriology", "field":"The scientific study of bacteria, especially in relation to disease and agriculture."},
	{"name":"Balneology", "field":"The study of the treatment of disease by bathing, usually practiced at spas."},
	{"name":"Barology", "field":"The study of gravity and weight and their relation."},
	{"name":"Bascology", "field":"The study of Basque language and culture."},
	{"name":"Batology", "field":"The scientific study of plants in the genus Rubus, commonly known as brambles."},
	{"name":"Bibliology", "field":"The study of books as physical, cultural objects."},
	{"name":"Biocenology", "field":"The branch of biology dealing with the study of biological communities and the interactions among their members."},
	{"name":"Bioclimatology", "field":"The interdisciplinary field of science that studies the interactions between the biosphere and the Earth's atmosphere on time scales of the order of seasons or longer (in opposition to biometeorology)."},
	{"name":"Bioecology", "field":"The study of the relationship of organisms to each other and to their environment."},
	{"name":"Biogerontology", "field":"The sub-field of gerontology concerned with the biological aging process, its evolutionary origins, and potential means to intervene in the process."},
	{"name":"Biology", "field":"The study of life and living organisms and their morphology, anatomy, and physiology."},
	{"name":"Biometeorology", "field":"The study of the relationship between atmospheric conditions (the weather) and living organisms."},
	{"name":"Biopsychology", "field":"The application of the principles of biology to the study of physiological, genetic, and developmental mechanisms of behavior in humans and other animals."},
	{"name":"Biospeleology", "field":"The branch of biology dedicated to the study of organisms that live in caves and are collectively referred to as troglofauna."},
	{"name":"Boxology", "field":"A representation of an organized structure as a graph of labelled nodes and connections between them (as lines or arrows)."},
	{"name":"Bracketology", "field":"The practice of predicting and analyzing sports tournament brackets."},
	{"name":"Brewology", "field":"The science or study of brewing, especially of brewing beer."},
	{"name":"Bromatology", "field":"The study of food."},
	{"name":"Brontology", "field":"The study of thunder."},
	{"name":"Bryology", "field":"The branch of botany concerned with the scientific study of bryophytes."},
	{"name":"Bumpology", "field":"Archaic and derogatory term for phrenology."},
	{"name":"Buttonology", "field":"The study of buttons."},
	{"name":"Byzantinology", "field":"The interdisciplinary branch of the humanities that addresses the history, culture, costumes, religion, art, such as literature and music, science, economy, and politics of the Byzantine Empire."},
	{"name":"Caliology", "field":"The study of birds nests."},
	{"name":"Campanology", "field":"The study of bells: their casting, tuning, and ringing."},
	{"name":"Cancerology", "field":"The study of cancer."},
	{"name":"Capology", "field":"Expertise in the mechanics of salary caps, the rules regulating the total amount of player compensation."},
	{"name":"Carabidology", "field":"The study of ground beetles (family Carabidae)."},
	{"name":"Carcinology", "field":"The study of crustaceans."},
	{"name":"Cardiology", "field":"The study of the heart."},
	{"name":"Caricology", "field":"The study of carex or sedges."},
	{"name":"Cariology", "field":"The study of dental caries and cariogenesis."},
	{"name":"Carphology", "field":"A lint-picking behavior that is often a symptom of a delirious state."},
	{"name":"Carpology", "field":"The study of the structure of seeds and fruit."},
	{"name":"Cartology", "field":"The creation of charts and maps based on the layout of a territory's geography."},
	{"name":"Catachronobiology", "field":"The study of the deleterious effects of time on a living system."},
	{"name":"Cecidiology", "field":"The study of galls or cecidia."},
	{"name":"Cephalology", "field":"The science of the head."},
	{"name":"Cerealogy", "field":"The study of crop circles."},
	{"name":"Cerebrology", "field":"The science that deals with the cerebrum or brain."},
	{"name":"Cereology", "field":"The study of, or practice of creating crop circles."},
	{"name":"Cetology", "field":"The branch of zoology concerned with the order Cetacea, which includes whales, dolphins, and porpoises."},
	{"name":"Chalcidology", "field":"The study of chalcid wasps."},
	{"name":"Chaology", "field":"The study of chaos and chaotic systems."},
	{"name":"Characterology", "field":"The study of character reading that attempts to combine revised physiognomy, reconstructed phrenology and amplified pathognomy, with ethnology, sociology and anthropology."},
	{"name":"Cheesology", "field":"The study of cheese."},
	{"name":"Chelonology", "field":"The study of turtles or tortoises (order Chelonia)."},
	{"name":"Chemoimmunology", "field":"The branch of chemistry that studies the chemical processes in immunology."},
	{"name":"Chessology", "field":"The study of chess."},
	{"name":"Chirology", "field":"The study of the hand."},
	{"name":"Chondrology", "field":"The study of cartilage."},
	{"name":"Choreology", "field":"The study of the aesthetic and science of forms of human movement by special notation."},
	{"name":"Chorology", "field":"The study of the causal relations between geographical phenomena occurring within a particular region"},
	{"name":"Chresmology", "field":"The study of prophecies."},
	{"name":"Christology", "field":"The field of study within Christian theology which is primarily concerned with the nature and person of Jesus as recorded in the canonical Gospels and the epistles of the New Testament."},
	{"name":"Chromatology", "field":"The study of colour."},
	{"name":"Chronobiology", "field":"A field of biology that examines periodic (cyclic) phenomena in living organisms and their adaptation to solar- and lunar-related rhythms."},
	{"name":"Chronology", "field":"The study of things in order of time or the study of time."},
	{"name":"Chronooncology", "field":"The study of the influence of biological rhythms on neoplastic growths."},
	{"name":"Chronopharmacology", "field":"The study of the effects of biological rhythms on pharmacotherapy and drug administration."},
	{"name":"Chrysology", "field":"The study of the production of wealth."},
	{"name":"Cinematology", "field":"The art and science of making movies; cinematography."},
	{"name":"Cirripedology", "field":"The study of barnacles."},
	{"name":"Climatology", "field":"The science that deals with climates, and investigates their phenomena and causes."},
	{"name":"Clinology", "field":"The study of retrogression and decline in form and function in an animal or organism."},
	{"name":"Clonology", "field":"The science or study of cloning and clones."},
	{"name":"Clownology", "field":"The study of being a clown."},
	{"name":"Coalitionology", "field":"Speculation in the run-up to a general election about possible coalition governments that might ensue. Used in Britain and Ireland."},
	{"name":"Coccidology", "field":"The study of scale insects, mealybugs, and organisms within the superfamily Coccoidea."},
	{"name":"Codicology", "field":"The study of books as physical objects, especially manuscripts written on parchment (or paper) in codex form."},
	{"name":"Cognitology", "field":"The multidisciplinary study of mind and behavior."},
	{"name":"Cohomology", "field":"The theory of a sequence of abelian groups associated to a topological space, often defined from a cochain complex."},
	{"name":"Coleopterology", "field":"The scientific study of beetles (order Coleoptera)."},
	{"name":"Coloproctology", "field":"Branch of medicine dealing with pathology of the colon, rectum, and anus and colorectal surgery."},
	{"name":"Cometology", "field":"The branch of astronomy that deals with comets."},
	{"name":"Comitology", "field":"In the European Union, the system of committees, composed of representatives of the member states, used to oversee European Commission implementing acts made under European Union legislation."},
	{"name":"Complementology", "field":"The branch of immunology that deals with complement (one of four proteolytic cascades in blood)."},
	{"name":"Computerology", "field":"The study of computers, or any kind of work with computers."},
	{"name":"Conchology", "field":"The study of molluscs and their shells."},
	{"name":"Coniology", "field":"The study of atmospheric dust and its effects on organisms."},
	{"name":"Connectology", "field":"The configuration according to which devices, tubes, etc. are connected. Used in medicine."},
	{"name":"Conscientology", "field":"The study of consciousness."},
	{"name":"Conspiratology", "field":"The study of conspiracies."},
	{"name":"Contrology", "field":"The methods of the physical fitness system called Pilates."},
	{"name":"Coprology", "field":"The study of feces."},
	{"name":"Cosmecology", "field":"The science that considers the earth in its relation to cosmic phenomena."},
	{"name":"Cosmetology", "field":"The science or study of cosmetics or being a beautician."},
	{"name":"Cosmochronology", "field":"The science of determining timescales for astrophysical objects and events."},
	{"name":"Cosmology", "field":"The study of the origin, evolution, and eventual fate of the universe."},
	{"name":"Craniology", "field":"A pseudomedicine primarily focused on measurements of the human skull, based on the concept that the brain is the organ of the mind and the mental state can be determined by physical external characteristics."},
	{"name":"Crapology", "field":"Nonsense, rubbish. Derived from the word crap."},
	{"name":"Crenology", "field":"The utilization of mineral springs for therapeutic purposes."},
	{"name":"Criminology", "field":"The scientific study of the nature, extent, management, causes, control, consequences, and prevention of criminal behavior, both on the individual and social levels."},
	{"name":"Criteriology", "field":"The part of logic dealing with the establishment of criteria."},
	{"name":"Crustaceology", "field":"The branch of zoology dealing with crustaceans."},
	{"name":"Cryobiology", "field":"The study of biological material or systems at temperatures below normal."},
	{"name":"Cryology", "field":"The study of very low temperatures and related phenomena."},
	{"name":"Cryopedology", "field":"The study of frozen grounds and intensive frost action."},
	{"name":"Cryptology", "field":"The study and practice of analyzing encoded messages, in order to decode them."},
	{"name":"Cryptozoology", "field":"A pseudoscience involving the search for creatures whose existence has not been proven due to lack of evidence."},
	{"name":"Crystallology", "field":"The study of the crystalline structure of inorganic bodies."},
	{"name":"Ctetology", "field":"The branch of biology that studies the origin and development of acquired characteristics."},
	{"name":"Curiology", "field":"The study of picture writing, especially crude hieroglyphics."},
	{"name":"Cyclonology", "field":"The study of cyclones."},
	{"name":"Cyesiology", "field":"The study of gestation and pregnancy."},
	{"name":"Cynology", "field":"The study of dogs."},
	{"name":"Cystology", "field":"The study of cysts."},
	{"name":"Cytology", "field":"The study of cells."},
	{"name":"Cytomorphology", "field":"The study of the structure of cells."},
	{"name":"Cytopathology", "field":"A branch of pathology that studies and diagnoses diseases on the cellular level."},
	{"name":"Cytophysiology", "field":"The physiology of cells."},
	{"name":"Cytotechnology", "field":"The study of cells to detect cancer and other abnormalities."},
	{"name":"Dacology", "field":"The study of ancient Dacia and its culture and antiquities."},
	{"name":"Dactyliology", "field":"The study of gem engraving."},
	{"name":"Daemonology", "field":"The study of demons, especially the incantations required to summon and control them."},
	{"name":"Dantology", "field":"The study of Dante Alighieri and his works."},
	{"name":"Defectology", "field":"A branch of science that is concerned with the study of the principles and characteristics of the development of children with physical and mental defects and the problems of their training and upbringing. Also describes the training of teachers of handicapped children. (Used in former Soviet Union.)"},
	{"name":"Deltiology", "field":"The study and collection of postcards."},
	{"name":"Demology", "field":"The study of human populations, activities, social conditions, and behaviour."},
	{"name":"Demonology", "field":"The study of demons, especially the incantations required to summon and control them."},
	{"name":"Dendroarcheology", "field":"In archeology, the science that uses dendrochronology to date wooden material from archeological sites."},
	{"name":"Dendrochronology", "field":"The science that uses the spacing between the annual growth rings of trees to date their exact year of formation."},
	{"name":"Dendroclimatology", "field":"The science that uses dendrochronology to reconstruct historical climate conditions."},
	{"name":"Dendroecology", "field":"The science that uses dendrochronology to analyze historic ecological processes."},
	{"name":"Dendrogeomorphology", "field":"The science that uses dendrochronology to study changes to the Earth's surface over time."},
	{"name":"Dendrohydrology", "field":"The science that uses dendrochronology to investigate and reconstruct hydrologic processes, such as river flow and past lake levels."},
	{"name":"Dendrology", "field":"The study of trees."},
	{"name":"Dendropyrochronology", "field":"The use of tree rings to study and reconstruct the history of wild fires."},
	{"name":"Deontology", "field":"The study of the nature of duty and obligation."},
	{"name":"Dermatology", "field":"The study of skin."},
	{"name":"Dermatoneurology", "field":"The study of nerves of the skin."},
	{"name":"Dermatopathology", "field":"A subspecialty of dermatology and pathology and to a lesser extent of surgical pathology that focuses on the study of cutaneous (skin) diseases at a microscopic and molecular level."},
	{"name":"Dermatovenerology", "field":"The study of skin disease and sexually transmitted disease and how symptoms of STD's appear on the skin."},
	{"name":"Dermonosology", "field":"The science of nomenclature and classification of skin diseases."},
	{"name":"Desmidiology", "field":"The study of single-celled algae."},
	{"name":"Desmology", "field":"The study of ligaments."},
	{"name":"Diabetology", "field":"The study of Diabetes mellitus."},
	{"name":"Diabology", "field":"The study of the devil and beliefs of the devil in religion."},
	{"name":"Dialectology", "field":"The scientific study of linguistic dialect, a sub-field of sociolinguistics."},
	{"name":"Dinosaurology", "field":"The branch of paleontology that focuses on studying dinosaurs."},
	{"name":"Diplomatology", "field":"The study of diplomatics."},
	{"name":"Dipterology", "field":"The study of flies (order Diptera)."},
	{"name":"Docimology", "field":"The study or act of scientific testing or assaying metals and ores."},
	{"name":"Dogmatology", "field":"The study of religious dogma."},
	{"name":"Dosiology", "field":"The study of dosages of drugs."},
	{"name":"Dosology", "field":"The study of dosages of drugs."},
	{"name":"Dracology", "field":"The study of the mythology surrounding dragons."},
	{"name":"Draconology", "field":"The study of dragons."},
	{"name":"Dragonology", "field":"The study of dragons."},
	{"name":"Dysteleology", "field":"The philosophical view that existence has no telos or final cause from purposeful design."},
	{"name":"Ecclesiology", "field":"The theological study of the Christian Church."},
	{"name":"Eccrinology", "field":"The study of the secretion of the eccrine glands."},
	{"name":"Echinology", "field":"The study of echinoderms."},
	{"name":"Ecohydrology", "field":"The study of the interactions between water and ecosystems."},
	{"name":"Ecology", "field":"The scientific study of interactions among organisms and their environment."},
	{"name":"Ecophysiology", "field":"The study of the adaptation of an organism's physiology to environmental conditions."},
	{"name":"Ecopsychology", "field":"The study of the relationship between human beings and the natural world through ecological and psychological principles."},
	{"name":"Ecotoxicology", "field":"The study of the effects of toxic chemicals on biological organisms, especially at the population, community, ecosystem level."},
	{"name":"Edaphology", "field":"A soil science concerned with the influence of soils on living things, particularly plants."},
	{"name":"Editology", "field":"The study of editing."},
	{"name":"Egyptology", "field":"The study of ancient Egyptian history, language, literature, religion, architecture and art from the 5th millennium BC until the end of its native religious practices in the 4th century AD."},
	{"name":"Eidology", "field":"The study of mental imagery."},
	{"name":"Electrobiology", "field":"The study of the production and use of electricity by biological organisms."},
	{"name":"Electrology", "field":"The branch of physical science that deals with electricity and its properties."},
	{"name":"Electrophysiology", "field":"The study of the electrical properties of biological cells and tissues."},
	{"name":"Emblematology", "field":"The study of emblems."},
	{"name":"Embryology", "field":"The branch of biology that studies the development of gametes (sex cells), fertilization, and development of embryos and fetuses."},
	{"name":"Emetology", "field":"The study of the causes of emesis (vomiting)."},
	{"name":"Emmenology", "field":"The study of menstruation."},
	{"name":"Emotionology", "field":"The multidisciplinary study of emotions."},
	{"name":"Encephalology", "field":"The study of the brain and its function, structure and anatomy, and diseases."},
	{"name":"Endemiology", "field":"The study of endemic diseases."},
	{"name":"Endocrinology", "field":"A branch of biology and medicine dealing with the endocrine system, its diseases, and its specific secretions known as hormones."},
	{"name":"Engysseismology", "field":"The branch of seismology that deals with earthquake shocks registered in or near the region of disturbance."},
	{"name":"Enigmatology", "field":"The study of puzzles."},
	{"name":"Enology", "field":"The study of wines."},
	{"name":"Enteradenology", "field":"The study of the gastrointestinal tract and glands."},
	{"name":"Enterology", "field":"The study of the intestinal tract."},
	{"name":"Entomechology", "field":"The study and design of mechanical insects."},
	{"name":"Entomology", "field":"The scientific study of insects, a branch of zoology."},
	{"name":"Entozoology", "field":"The study of entozoa, a type of microscopic parasitic worm."},
	{"name":"Entreprenology", "field":"The study of entrepreneurship."},
	{"name":"Enzymology", "field":"The branch of science that studies enzymes."},
	{"name":"Epidemiology", "field":"The study and analysis of the patterns, causes, and effects of health and disease conditions in defined populations."},
	{"name":"Epileptology", "field":"The branch of neurology that studies epilepsy."},
	{"name":"Epiphytology", "field":"The study of the character, ecology, and causes of plant diseases, especially epiphytotic outbreaks."},
	{"name":"Epistemology", "field":"The branch of philosophy concerned with the theory of knowledge."},
	{"name":"Epizootiology", "field":"The study of disease patterns within animal populations."},
	{"name":"Equinology", "field":"The study of horses."},
	{"name":"Eremology", "field":"The study of deserts."},
	{"name":"Ergology", "field":"The study of the psychological effects of work, or of work patterns; especially the causes of work-related stress (job stress)."},
	{"name":"Erotology", "field":"The study of sexual stimuli and behavior."},
	{"name":"Eschatology", "field":"A part of theology concerned with the final events of history, or the ultimate destiny of humanity."},
	{"name":"Eskimology", "field":"A complex of humanities sciences studying languages, history, literature, folklore, culture, and ethnology of people speaking Eskimo–Aleut languages and Eskimo (Inuit–Yupik)–Aleut peoples in chronological and comparative context."},
	{"name":"Esperantology", "field":"The study of Esperanto."},
	{"name":"Esperatology", "field":"The study of Esperanto."},
	{"name":"Ethnoarcheology", "field":"The ethnographic study of people for archeological reasons, usually through the study of the material remains of a society."},
	{"name":"Ethnobiology", "field":"The scientific study of the way living things are treated or used by different human cultures."},
	{"name":"Ethnocynology", "field":"A neologism referring to the study of dogs within their cultural context."},
	{"name":"Ethnoecology", "field":"The scientific study of how different groups of people living in different locations understand the ecosystems around them, and their relationships with surrounding environments."},
	{"name":"Ethnology", "field":"The branch of anthropology that compares and analyzes the characteristics of different people and the relationship between them."},
	{"name":"Ethnomethodology", "field":"The study of methods people use for understanding and producing the social order in which they live."},
	{"name":"Ethnomusicology", "field":"The study of the music of different cultures and their cultural contexts, especially non-Western ones."},
	{"name":"Ethnopsychology", "field":"The study of alternative perceptions of the mind and its behavior."},
	{"name":"Ethology", "field":"The scientific and objective study of non-human animal behaviour rather than human behaviour usually with a focus on behaviour under natural conditions, and viewing behaviour as an evolutionarily adaptive trait."},
	{"name":"Etiology", "field":"The study of causation, or origination."},
	{"name":"Etruscology", "field":"The study of the ancient Italian civilization of the Etruscans."},
	{"name":"Etymology", "field":"The study of the history of words, their origins, and how their form and meaning have changed over time."},
	{"name":"Exoarcheology", "field":"Argued to be the same as xenoarcheology, a fictional science concerned with the physical remains of alien cultures. May also mean the study of human activities in a space environment."},
	{"name":"Exobiology", "field":"The branch of biology dealing with extraterrestrial lifeforms."},
	{"name":"Exogeology", "field":"A planetary science discipline concerned with the geology of the celestial bodies such as the planets and their moons, asteroids, comets, and meteorites."},
	{"name":"Exomoonology", "field":"The search for and study of exomoons."},
	{"name":"Exoplanetology", "field":"An integrated field of astronomical science dedicated to the search and study of exoplanets (extrasolar planets)."},
	{"name":"Fairyology", "field":"The study of fairies."},
	{"name":"Faunology", "field":"The branch of zoology that deals with the geographical distribution of animals."},
	{"name":"Felinology", "field":"The study of cats."},
	{"name":"Fermentology", "field":"The study of ferments and fermentation."},
	{"name":"Fetology", "field":"The scientific study of fetuses."},
	{"name":"Filicology", "field":"The study of ferns."},
	{"name":"Flatology", "field":"The study of flatulence."},
	{"name":"Fluviology", "field":"The study of watercourses or rivers."},
	{"name":"Fluviomorphology", "field":"The study of a river channel and the network of tributaries within the river basin."},
	{"name":"Foliology", "field":"The study of autumnal leaf colour changes."},
	{"name":"Fontology", "field":"The study of fonts, or electronic typefaces."},
	{"name":"Formicology", "field":"The study of ants."},
	{"name":"Fornicology", "field":"The study of fornication."},
	{"name":"Fossilology", "field":"The study of fossils."},
	{"name":"Fromology", "field":"The study of cheese."},
	{"name":"Fronology", "field":"The study of the contour of the skull."},
	{"name":"Fungology", "field":"The study of fungi."},
	{"name":"Futurology", "field":"The study of postulating possible, probable, and preferable futures and the worldviews and myths that underlie them."},
	{"name":"Galvanology", "field":"The study of galvanism (of biology, physics, and chemistry)."},
	{"name":"Gametology", "field":"The study of gametes."},
	{"name":"Garbology", "field":"The study of modern refuse and trash as well as the use of trash cans, compactors and various types of trash can liners."},
	{"name":"Gastroenterology", "field":"The branch of medicine focused on the digestive system and its disorders."},
	{"name":"Gastrology", "field":"The branch of medicine focused on the digestive system and its disorders."},
	{"name":"Gelotology", "field":"The study of humour and laughter."},
	{"name":"Gemology", "field":"The scientific study dealing with natural and artificial gemstone materials."},
	{"name":"Genealogy", "field":"The study of families and the tracing of their lineages and history."},
	{"name":"Genecology", "field":"A branch of ecology which studies the gene frequency of a species relating to their population distribution in a particular environment."},
	{"name":"Genesiology", "field":"The study of reproduction."},
	{"name":"Genethlialogy", "field":"The divination of the destiny of a newborn by studying stars and heavenly bodies on the nativity."},
	{"name":"Geoarcheology", "field":"A multi-disciplinary approach which uses the techniques and subject matter of geography, geology and other Earth sciences to examine topics which inform archeological knowledge and thought."},
	{"name":"Geobiology", "field":"An interdisciplinary field of scientific research that explores interactions between the biosphere and the lithosphere and/or the atmosphere."},
	{"name":"Geochronology", "field":"The science of determining the age of rocks, fossils, and sediments using signatures inherent in the rocks themselves."},
	{"name":"Geoecology", "field":"The interdisciplinary study of geography and ecology."},
	{"name":"Geohydrology", "field":"The area of geology that deals with the distribution and movement of groundwater in the soil and rocks of the Earth's crust(commonly in aquifers)."},
	{"name":"Geology", "field":"An earth science comprising the study of solid Earth, the rocks of which it is composed, and the processes by which they change."},
	{"name":"Geomorphology", "field":"The scientific study of the origin and evolution of topographic and bathymetric features created by physical, chemical or biological processes operating at or near the Earth's surface."},
	{"name":"Geomythology", "field":"The study of alleged references to geological events in mythology."},
	{"name":"Geotechnology", "field":"The study of how earth, rock and subterranean water affect the planning, execution, and operation of engineering projects."},
	{"name":"Geotectology", "field":"The study of the structure of the Earth's crust; geotectonics."},
	{"name":"Gephyrology", "field":"The study of bridges and naturally occurring arches or bridge like structures."},
	{"name":"Geratology", "field":"The study of elderly people and senility; geriatrics."},
	{"name":"Gerodontology", "field":"The study of dentistry in elderly people."},
	{"name":"Gerontology", "field":"The study of the social, psychological, cognitive, and biological aspects of aging."},
	{"name":"Ghostology", "field":"The learning, teaching, knowledge, or study of ghosts, spirits, and the supernatural; ghostlore."},
	{"name":"Gigantology", "field":"The study or description of giants."},
	{"name":"Glaciology", "field":"The scientific study of glaciers, or more generally ice and natural phenomena that involve ice."},
	{"name":"Glossology", "field":"The scientific study of language change over time; historical linguistics."},
	{"name":"Glottochronology", "field":"The study of languages to determine when they diverged from being the same language."},
	{"name":"Glottology", "field":"The study of languages."},
	{"name":"Glycobiology", "field":"The study of the structure, biosynthesis, and biology of saccharides (sugar chains or glycans) that are widely distributed in nature."},
	{"name":"Glyptology", "field":"The study or art of engraving gems or glyptics."},
	{"name":"Gnathology", "field":"The study of the masticatory system."},
	{"name":"Gnomology", "field":"The study of gnomic poetry or gnomes and aphorisms."},
	{"name":"Gnomonology", "field":"The study of gnomonics."},
	{"name":"Gnoseology", "field":"The scientific or philosophical study of knowledge."},
	{"name":"Gnosiology", "field":"The scientific or philosophical study of knowledge."},
	{"name":"Gnotobiology", "field":"The study of animals in a germ-free environment"},
	{"name":"Googleology", "field":"The study of Google and its subsidiaries."},
	{"name":"Googology", "field":"The mathematical study of large numbers."},
	{"name":"Graminology", "field":"The scientific study of the grasses (family Poaceae)."},
	{"name":"Grammatology", "field":"The scientific study of writing systems or scripts."},
	{"name":"Graphology", "field":"The analysis of the physical characteristics and patterns of handwriting purporting to be able to identify the writer."},
	{"name":"Graphopathology", "field":"The study of handwriting as a symptom of mental or emotional disorder."},
	{"name":"Grossology", "field":"The study of things that are disgusting or gross."},
	{"name":"Gynecology", "field":"The medical practice dealing with the health of the female reproductive systems (vagina, uterus and ovaries) and the breasts."},
	{"name":"Gynoroentgenology", "field":"The study of radiologic imaging of the gynecologic parts of the female human body in order to make a radiologic diagnosis of a gynecologic disease."},
	{"name":"Hamartiology", "field":"The branch of Christian theology that studies sin."},
	{"name":"Hamburgerology", "field":"A course of study introduced by McDonald's to train people to work in its fast food restaurants."},
	{"name":"Harmonology", "field":"The study of harmonization."},
	{"name":"Hauntology", "field":"In Derridan philosophy, the paradoxical state of the spectre, which is neither being nor nonbeing."},
	{"name":"Hedonology", "field":"The study of the impact an injury or incident had on a persons lifestyle."},
	{"name":"Helcology", "field":"The study of ulcers."},
	{"name":"Heliology", "field":"The study of the sun."},
	{"name":"Helioseismology", "field":"The study of the propagation of wave oscillations, particularly acoustic pressure waves, in the Sun."},
	{"name":"Helminthology", "field":"The study of parasitic worms (helminths)."},
	{"name":"Hematology", "field":"The branch of medicine concerned with the study, diagnosis, treatment, and prevention of diseases related to blood."},
	{"name":"Hemerology", "field":"The study of calendars."},
	{"name":"Hemipterology", "field":"The study of true bugs (order Hemiptera)."},
	{"name":"Hemopathology", "field":"The branch of pathology which studies diseases of hematopoietic cells."},
	{"name":"Hemorheology", "field":"The study of flow properties of blood and its elements of plasma and cells."},
	{"name":"Henology", "field":"The philosophical account or discourse on 'The One' that appears most notably in the philosophy of Plotinus."},
	{"name":"Heortology", "field":"The study of religious festivals."},
	{"name":"Hepaticology", "field":"The study of hepatics (division Marchantiophyta)."},
	{"name":"Hepatology", "field":"The branch of medicine that incorporates the study of liver, gallbladder, biliary tree, and pancreas as well as management of their disorders."},
	{"name":"Herbology", "field":"The study of the use of plants for medicinal purposes; herbal medicine/herbalism."},
	{"name":"Heresiology", "field":"The study of heresy."},
	{"name":"Herpetology", "field":"The branch of zoology concerned with the study of amphibians (including frogs, toads, salamanders, newts, and caecilians (gymnophiona) and reptiles (including snakes, lizards, amphisbaenids, turtles, terrapins, tortoises, crocodilians, and the tuataras)."},
	{"name":"Heteroptology", "field":"The study of true bugs (suborder Heteroptera)."},
	{"name":"Heterotopology", "field":"The study of heterotopias, that is, 'a systematic approach that analyzes and describes the features of other spaces' as said by Michel Foucault."},
	{"name":"Hexicology", "field":"The study of the relations of living creatures to other organisms, and to their surrounding conditions."},
	{"name":"Hexiology", "field":"The study of the relations of living creatures to other organisms, and to their surrounding conditions."},
	{"name":"Hieroglyphology", "field":"The study of hieroglyphics."},
	{"name":"Hierology", "field":"Sacred literature or lore or the study of it."},
	{"name":"Hippology", "field":"The study of horses."},
	{"name":"Hippopathology", "field":"The study of the diseases and treatment or pathology of the horse."},
	{"name":"Histiology", "field":"The study of the microscopic anatomy (microanatomy) of cells and tissues of plants and animals."},
	{"name":"Histology", "field":"The study of the microscopic anatomy of cells and tissues of plants and animals."},
	{"name":"Histopathology", "field":"The microscopic examination of tissue in order to study the manifestations of disease."},
	{"name":"Histophysiology", "field":"The physiology or study of the functions of the cells and tissues in health."},
	{"name":"Historiology", "field":"The study of history."},
	{"name":"Hittitology", "field":"The study of the Hittites."},
	{"name":"Hodology", "field":"The study of pathways."},
	{"name":"Homerology", "field":"The study of the poet Homer and his works."},
	{"name":"Homology", "field":"The study of association"},
	{"name":"Hoplology", "field":"A science that studies human combative behavior and performance."},
	{"name":"Hormonology", "field":"The science or study of hormones."},
	{"name":"Horology", "field":"The art or science of measuring time and mechanical time-keeping devices."},
	{"name":"Humorology", "field":"The study of humour and laughter."},
	{"name":"Hydrobiology", "field":"The science of life and life processes in water."},
	{"name":"Hydroecology", "field":"The study of support systems in wetlands such as the interactions between water and wildlife habitats."},
	{"name":"Hydrogeology", "field":"The area of geology that deals with the distribution and movement of groundwater in the soil and rocks of the Earth's crust(commonly in aquifers)."},
	{"name":"Hydrology", "field":"The scientific study of the movement, distribution, and quality of water on Earth and other planets, including the hydrologic cycle, water resources and environmental watershed sustainability."},
	{"name":"Hydrometeorology", "field":"A branch of meteorology and hydrology that studies the transfer of water and energy between the land surface and the lower atmosphere."},
	{"name":"Hyetology", "field":"The scientific study of precipitation."},
	{"name":"Hygiology", "field":"The science and study of the preservation of health."},
	{"name":"Hygrology", "field":"The study of bodily fluids."},
	{"name":"Hylology", "field":"The doctrine or theory of matter as unorganized."},
	{"name":"Hymenopterology", "field":"The study of the order Hymenoptera."},
	{"name":"Hymnology", "field":"The scholarly study of religious song, or the hymn."},
	{"name":"Hypnology", "field":"The scientific study of sleep."},
	{"name":"Iamatology", "field":"The study of medicinal remedies or therapeutics."},
	{"name":"Iatrology", "field":"The study of medicine."},
	{"name":"Ichnolithology", "field":"The branch of geology and biology that deals with traces of organismal behavior, such as footprints and burrows."},
	{"name":"Ichnology", "field":"The branch of geology and biology that deals with traces of organismal behavior, such as footprints and burrows."},
	{"name":"Ichthyology", "field":"The branch of biology devoted to the study of fish."},
	{"name":"Iconology", "field":"The study of visual imagery and its symbolism and interpretation, especially in social or political terms."},
	{"name":"Idiomatology", "field":"The study of idioms and idiomatic language."},
	{"name":"Idiomology", "field":"The study of idiom, jargon, or dialect."},
	{"name":"Idiopsychology", "field":"The psychology of one's own mind."},
	{"name":"Imageology", "field":"The study of images, especially those produced by medical imaging."},
	{"name":"Imagology", "field":"The study of cultural stereotypes as presented in literature."},
	{"name":"Immunohematology", "field":"The study of the relationships between disorders of the blood and the immune system, especially antigen-antibody interaction."},
	{"name":"Immunology", "field":"A branch of biomedical science that covers the study of immune systems in all organisms."},
	{"name":"Immunopathology", "field":"The branch of medicine that deals with immune responses associated with disease."},
	{"name":"Implantology", "field":"The science of or techniques involved in dental implants."},
	{"name":"Indology", "field":"The academic study of the history and cultures, languages, and literature of the Indian subcontinent (most specifically the modern-day states of India, Pakistan, Bangladesh, Sri Lanka, Maldives, Nepal and the eastern parts of Afghanistan)"},
	{"name":"Infectiology", "field":"The study of the diagnosis, treatment, and control of infections and infectious diseases."},
	{"name":"Insectology", "field":"The study of insects."},
	{"name":"Inuitology", "field":"A complex of humanities sciences studying languages, history, literature, folklore, culture, and ethnology of people speaking Eskimo–Aleut languages and Eskimo (Inuit–Yupik)–Aleut peoples in chronological and comparative context."},
	{"name":"Iranology", "field":"An interdisciplinary field dealing with the study of history, literature, art and culture of Iranian peoples."},
	{"name":"Irenology", "field":"The study of peace."},
	{"name":"Iridology", "field":"An alternative medicine technique whose proponents claim that patterns, colors, and other characteristics of the iris can be examined to determine information about a person's health; iridodiagnosis."},
	{"name":"Islamology", "field":"The study of Islam."},
	{"name":"Japanology", "field":"The study of Japan, its language, culture, and history."},
	{"name":"Jinology", "field":"The study of Jin Yong's novels."},
	{"name":"Judeology", "field":"The study of Judaism."},
	{"name":"Kalology", "field":"The study of beauty and aesthetics."},
	{"name":"Karyology", "field":"The study of the nuclei of cells, especially with regard to the chromosomes which they contain."},
	{"name":"Killology", "field":"The study of the psychological and physiological effects of killing and combat on the human psyche."},
	{"name":"Kinesiology", "field":"The scientific study of human body movement and its physiological, mechanical, and psychological mechanisms."},
	{"name":"Kinology", "field":"The branch of physics that deals with the laws of motion."},
	{"name":"Knobology", "field":"The functionality of controls on an instrument as relevant to their application."},
	{"name":"Koniology", "field":"The study of atmospheric dust and its effects."},
	{"name":"Kookology", "field":"The study of kooks, or eccentric people."},
	{"name":"Koreanology", "field":"The study of Korea."},
	{"name":"Kremlinology", "field":"The study of the internal politics of the high members of the government of the USSR."},
	{"name":"Ktenology", "field":"The science of putting people to death, execution."},
	{"name":"Kubrickology", "field":"The study of Stanley Kubrick and his works."},
	{"name":"Kymatology", "field":"The study of wave motion."},
	{"name":"Lalopathology", "field":"The study of speech disorders."},
	{"name":"Laryngology", "field":"A branch of medicine that deals with disorders, diseases and injuries of the vocal apparatus, especially the larynx."},
	{"name":"Latrinology", "field":"The study of writings on restroom walls."},
	{"name":"Lectinology", "field":"The study of lectin."},
	{"name":"Lemology", "field":"The study of plague and epidemic diseases."},
	{"name":"Lepidopterology", "field":"A branch of entomology concerning the scientific study of moths and the three superfamilies of butterflies."},
	{"name":"Leprology", "field":"The study of leprosy."},
	{"name":"Leptology", "field":"The study of the forms and structures of crystals; crystallography."},
	{"name":"Lexicology", "field":"The part of linguistics which studies words."},
	{"name":"Lichenology", "field":"The branch of mycology that studies the lichens, symbiotic organisms made up of an intimate symbiotic association of a microscopic alga (or a cyanbacterium) with a filamentous fungus."},
	{"name":"Limacology", "field":"The branch of zoology which deals with slugs."},
	{"name":"Limnobiology", "field":"The branch of biology that deals with animals and plants of fresh water."},
	{"name":"Limnology", "field":"The study of inland waters."},
	{"name":"Lipsology", "field":"The art and science of reading lip prints in order to determine characteristics about a person."},
	{"name":"Literaturology", "field":"The study of literature."},
	{"name":"Lithoidology", "field":"The study of rocks."},
	{"name":"Lithology", "field":"The study of rocks, with particular emphasis on their description and classification."},
	{"name":"Liturgiology", "field":"The study of liturgy, a set of rituals that are performed, usually by a religion; liturgics."},
	{"name":"Logology", "field":"The field of recreational linguistics, an activity that encompasses a wide variety of word games and wordplay. The study of all aspects of science"},
	{"name":"Logyology", "field":"The study of the study of things."},
	{"name":"Loimology", "field":"The study of pestilential diseases and plagues."},
	{"name":"Ludology", "field":"The study of games."},
	{"name":"Lymphology", "field":"The study of the lymphatic system."},
	{"name":"Machirology", "field":"The study or collection of knives."},
	{"name":"Macrocosmology", "field":"The study or description of the macrocosm."},
	{"name":"Macroecology", "field":"The subfield of ecology that deals with the study of relationships between organisms and their environment at large spatial scales."},
	{"name":"Macrometeorology", "field":"The study of large-scale behavior of the atmosphere."},
	{"name":"Macromorphology", "field":"The gross structures or morphology of an organism, mineral, or soil component visible with the unaided eye or at very low levels of magnification."},
	{"name":"Magicology", "field":"The study of magic."},
	{"name":"Magirology", "field":"The study of cooking."},
	{"name":"Malacology", "field":"The branch of invertebrate zoology that deals with the study of Mollusca."},
	{"name":"Malacostracology", "field":"The study of crustaceans."},
	{"name":"Malariology", "field":"The study of malaria."},
	{"name":"Mammalogy", "field":"The study of mammals."},
	{"name":"Mantology", "field":"The study or art of fortune telling."},
	{"name":"Mapology", "field":"The study of maps; cartography."},
	{"name":"Mariology", "field":"The theological study of Mary, the mother of Jesus."},
	{"name":"Martyrology", "field":"the branch of history or literature that deals with the lives of martyrs."},
	{"name":"Mastology", "field":"The study of breasts."},
	{"name":"Mazology", "field":"The study of mammals."},
	{"name":"Meconology", "field":"The study of opium and its effects."},
	{"name":"Melissopalynology", "field":"The study of pollen contained in honey and, in particular, the pollen's source."},
	{"name":"Melittology", "field":"A branch of entomology concerning the scientific study of bees (clade Anthophila)."},
	{"name":"Mellittology", "field":"A branch of entomology concerning the scientific study of bees (clade Anthophila)."},
	{"name":"Membranology", "field":"The study of membranes."},
	{"name":"Mereology", "field":"In logic and philosophy, the study of parts and the wholes they form."},
	{"name":"Mesology", "field":"The scientific analysis and study of interactions among organisms and their environment."},
	{"name":"Mesometeorology", "field":"The study of weather systems smaller than synoptic scale systems but larger than microscale and storm-scale cumulus systems."},
	{"name":"Metallogeny", "field":"The study of the genesis and regional-to-global distribution of mineral deposits, with emphasis on their relationship in space and time to regional petrologic and tectonic features of the Earth's crust."},
	{"name":"Metapsychology", "field":"A speculative psychology which seeks to understand the structure of the mind in terms which may not be empirically verifiable."},
	{"name":"Meteorology", "field":"The study of the atmosphere and related phenomena such as weather."},
	{"name":"Methodology", "field":"The systematic, theoretical analysis of the methods applied to a field of study; the study of methods."},
	{"name":"Metrology", "field":"The science and study of measurement."},
	{"name":"Miasmology", "field":"The study of fog and smog."},
	{"name":"Microbiology", "field":"The study of microorganisms."},
	{"name":"Microclimatology", "field":"A branch of climatology that studies microclimates which are small, local region having a unique pattern of weather or weather effects that differ from the local climate."},
	{"name":"Microecology", "field":"The ecology of microbes."},
	{"name":"Micrology", "field":"The study of microscopes."},
	{"name":"Micrometeorology", "field":"The study of short-lived atmospheric phenomena smaller than mesoscale."},
	{"name":"Micromorphology", "field":"The fine-level structures (microstructures) or morphology of an organism, mineral, or soil component visible through microscopy."},
	{"name":"Micropaleontology", "field":"The branch of paleontology that studies microfossils, or fossils that require the use of a microscope to see the organism, its morphology and its characteristics details."},
	{"name":"Microphytology", "field":"The study of very small or microscopic plant life."},
	{"name":"Microseismology", "field":"The study of microseisms."},
	{"name":"Mineralogy", "field":"The study of minerals."},
	{"name":"Missiology", "field":"The area of practical theology that investigates the mandate, message, and mission of the Christian church, especially the nature of missionary work."},
	{"name":"Mixology", "field":"The art of combining various ingredients to make cocktails."},
	{"name":"Mnesiology", "field":"The study of memory."},
	{"name":"Mobilology", "field":"The study of human behavior in a mobile world and the study of mobile device/phone lifestyles."},
	{"name":"Mociology", "field":"The study of human behavior in a mobile world and the study of mobile device/phone lifestyles."},
	{"name":"Molinology", "field":"The study of mills and other mechanical devices which use the energy of moving water or wind, or the strength of animal or human muscle to power machines."},
	{"name":"Momilogy", "field":"The study of mummies."},
	{"name":"Momiology", "field":"The study of mummies."},
	{"name":"Monadology", "field":"The study of theory of monads."},
	{"name":"Monsterology", "field":"The study of monsters or cryptids."},
	{"name":"Montology", "field":"The study of mountains."},
	{"name":"Morphology", "field":"The study of the forms of things."},
	{"name":"Morphonology", "field":"The branch of linguistics that studies the interaction between morphological and phonological or phonetic processes."},
	{"name":"Muscology", "field":"The branch of botany concerned with the scientific study of bryophytes (mosses, liverworts, and hornworts)."},
	{"name":"Museology", "field":"The study of the designs, organization, and management of museums."},
	{"name":"Musicology", "field":"The study of music, music history, music theory, or the physical nature of sound."},
	{"name":"Mycetology", "field":"The study of fungi."},
	{"name":"Mycology", "field":"The branch of biology concerned with the study of fungi."},
	{"name":"Mycotoxicology", "field":"The branch of mycology that focuses on analyzing and studying the toxins produced by fungi, known as mycotoxins."},
	{"name":"Myology", "field":"The study of the muscular system."},
	{"name":"Myrmecology", "field":"The branch of entomology focusing on the scientific study of ants."},
	{"name":"Mythology", "field":"The study of myths."},
	{"name":"Nanotechnology", "field":"The manipulation of matter on an atomic, molecular, and supramolecular scale. Otherwise accepted as the manipulation of matter with at least one dimension sized from 1 to 100 nanometers."},
	{"name":"Nanotribology", "field":"A branch of tribology which studies friction phenomenon at the nanometer scale."},
	{"name":"Naology", "field":"The study of ecclesiastical or sacred buildings."},
	{"name":"Narratology", "field":"The theory and the study of narrative and narrative structure and the ways that these affect our perception."},
	{"name":"Nasology", "field":"The study of the nose."},
	{"name":"Nassology", "field":"The science or art of stuffing animals for display; taxidermy."},
	{"name":"Necrology", "field":"The study of death or the dead."},
	{"name":"Nematology", "field":"The scientific study of nematodes."},
	{"name":"Neoichnology", "field":"The study of footprints and traces of extant animals."},
	{"name":"Neology", "field":"The study or art of creating new words or neologizing."},
	{"name":"Neonatology", "field":"A subspecialty of pediatrics that consists of the medical care of newborn infants."},
	{"name":"Neossology", "field":"The study of young birds."},
	{"name":"Nephology", "field":"The study of clouds."},
	{"name":"Nephrology", "field":"The study of kidneys."},
	{"name":"Nerterology", "field":"Any study that pertains to the dead or death."},
	{"name":"Nessology", "field":"The belief or study of the loch ness monster."},
	{"name":"Neurobiology", "field":"The study of the nervous system including the brain."},
	{"name":"Neuroendocrinology", "field":"The study of the interaction between the nervous system and the endocrine system."},
	{"name":"Neuroethology", "field":"The study of animal behavior and its underlying mechanistic control by the nervous system."},
	{"name":"Neurohypnology", "field":"The study or practice of mesmerism or hypnotism."},
	{"name":"Neurology", "field":"A branch of medicine dealing with neurological disorders."},
	{"name":"Neuropathology", "field":"The study of disease of nervous system tissue."},
	{"name":"Neuropharmacology", "field":"The study of how drugs affect cellular function in the nervous system."},
	{"name":"Neurophysiology", "field":"A branch of physiology and neuroscience that is concerned with the study of the functioning of the nervous system."},
	{"name":"Neuropsychology", "field":"The study of the structure and function of the brain as it relates to specific psychological processes and behaviors."},
	{"name":"Neuropterology", "field":"The study of net-winged insects (order Neuroptera)."},
	{"name":"Neuroradiology", "field":"A subspecialty of radiology focusing on the diagnosis and characterization of abnormalities of the central and peripheral nervous system, spine, and head and neck using neuroimaging techniques."},
	{"name":"Neurypnology", "field":"The study or practice of mesmerism or hypnotism."},
	{"name":"Nidology", "field":"The study of birds nests."},
	{"name":"Nomology", "field":"The study of laws."},
	{"name":"Noology", "field":"The systematic study and organization of everything dealing with knowing and knowledge."},
	{"name":"Nosetiology", "field":"The study of the causes of disease."},
	{"name":"Nosology", "field":"A branch of medicine dealing with the classification of disease."},
	{"name":"Nostology", "field":"The study of senility or the mental problems of aging."},
	{"name":"Numerology", "field":"The study of the purported mystical relationship between numbers and the character or action of physical objects and living things."},
	{"name":"Numismatology", "field":"The study or collection of money (coins, tokens, medals, paper money); numismatics."},
	{"name":"Nymphology", "field":"The study of nymphs."},
	{"name":"Oceanology", "field":"The branch of Earth science that studies the ocean; oceanography."},
	{"name":"Odology", "field":"The study of odic force."},
	{"name":"Odonatology", "field":"The study of dragonflies and damselflies (order Odonata)."},
	{"name":"Odontology", "field":"The study of the structure and development of teeth."},
	{"name":"Oecology", "field":"The scientific study of interactions among organisms and their environment."},
	{"name":"Oenology", "field":"The science and study of all aspects of wine and winemaking with the exception of vine-growing and grape-harvesting which pertains to viticulture."},
	{"name":"Oikology", "field":"The science of houses and homes, considered especially in respect of their sanitary conditions."},
	{"name":"Oinology", "field":"The science and study of all aspects of wine and winemaking with the exception of vine-growing and grape-harvesting which pertains to viticulture."},
	{"name":"Olfactology", "field":"The study of smell."},
	{"name":"Oligochaetology", "field":"The study of earthworms (class Oligochaeta)."},
	{"name":"Ombrology", "field":"The study of rain."},
	{"name":"Omenology", "field":"The study of omens, divination."},
	{"name":"Omnibology", "field":"The study of motor buses or omnibuses."},
	{"name":"Omphalology", "field":"A medical field of study whose specialty is not identified."},
	{"name":"Oncology", "field":"The branch of medicine that deals with the prevention, diagnosis and treatment of cancer."},
	{"name":"Oneirology", "field":"The scientific study of dreams."},
	{"name":"Onomasiology", "field":"The branch of lexicology that deals with concepts and the terms that represent them, in particular contrasting terms for similar concepts, as in a thesaurus."},
	{"name":"Onomatology", "field":"The study of the origin, history, and use of proper names; onomastics."},
	{"name":"Ontology", "field":"The study of being"},
	{"name":"Onychopathology", "field":"The study of nail disease."},
	{"name":"Oology", "field":"The study of eggs, especially those of birds."},
	{"name":"Ophidology", "field":"The study of snakes (clade Ophidia)."},
	{"name":"Ophiology", "field":"The branch of herpetology dealing with the study of snakes (clade ophidia)."},
	{"name":"Ophthalmology", "field":"The branch of medicine that deals with the anatomy, physiology and diseases of the eye."},
	{"name":"Opsonology", "field":"The study of antibody opsonization."},
	{"name":"Optology", "field":"The science of testing eyes for lenses."},
	{"name":"Orchidology", "field":"The study of orchids (family orchidaceae)."},
	{"name":"Oreology", "field":"The study of mountains."},
	{"name":"Organology", "field":"The study of musical instruments and their classification."},
	{"name":"Orismology", "field":"The identification, specification, and description of technical terms."},
	{"name":"Ornithology", "field":"A branch of zoology dealing with the study of birds."},
	{"name":"Orology", "field":"The study of mountains."},
	{"name":"Orrhology", "field":"The study of serum."},
	{"name":"Orthology", "field":"The study of the correct use of words."},
	{"name":"Orthopterology", "field":"The scientific study of the order Orthoptera."},
	{"name":"Oryctology", "field":"The study of fossils, minerals, and rocks."},
	{"name":"Osmology", "field":"The scientific study of smells."},
	{"name":"Osphresiology", "field":"The study of smell"},
	{"name":"Osteology", "field":"The scientific study of bones."},
	{"name":"Osteopathology", "field":"The study of diseases of the bone."},
	{"name":"Otolaryngology", "field":"The branch of medicine that deals with conditions of the ear, nose, and throat (ENT) region."},
	{"name":"Otology", "field":"A branch of medicine which studies normal and pathological anatomy and physiology of the ear (hearing and vestibular sensory systems and related structures and functions)."},
	{"name":"Otorhinolaryngology", "field":"The branch of medicine that deals with conditions of the ear, nose, and throat (ENT) region."},
	{"name":"Ourology", "field":"The branch of medicine that focuses on surgical and medical diseases of the male and female urinary tract system and the male reproductive organs."},
	{"name":"Ovology", "field":"The study of eggs."},
	{"name":"Pachydermatology", "field":"The study of elephant skin. (humorous)"},
	{"name":"Paedology", "field":"The study of children's behavior and development."},
	{"name":"Paidonosology", "field":"The study of children's diseases."},
	{"name":"Paleoalgology", "field":"The subdiscipline of paleobotany that deals with the study and identification of fossil algae and their evolutionary relationships and ecology."},
	{"name":"Paleoanthropology", "field":"The scientific study of human fossils, and the evolution of modern man."},
	{"name":"Paleobiology", "field":"The study of fossils of plants and animals."},
	{"name":"Paleobotany", "field":"The branch of paleontology that deals with the study of plant fossils."},
	{"name":"Paleoclimatology", "field":"The study of changes in climate taken on the scale of the entire history of Earth."},
	{"name":"Paleodendrology", "field":"The branch of paleobotany that deals with fossil trees."},
	{"name":"Paleoecology", "field":"The scientific study of reconstructing ecosystems in the past using fossils and subfossils."},
	{"name":"Paleoentomology", "field":"The study of prehistoric insects."},
	{"name":"Paleoethnology", "field":"The study of the races of early man."},
	{"name":"Paleogeology", "field":"The study of ancient geological features."},
	{"name":"Paleohydrology", "field":"The study of ancient rivers and other hydrological features."},
	{"name":"Paleoichnology", "field":"The branch of ichnology concerned with the study of trace fossils preserved in ancient rocks."},
	{"name":"Paleoichthyology", "field":"The study of fossil and ancient fish."},
	{"name":"Paleolimnology", "field":"The study of paleoenvironments of inland waters by examination of sediment and fossils."},
	{"name":"Paleology", "field":"The study of antiquities."},
	{"name":"Paleometeorology", "field":"The meteorology of the earth's atmosphere during ancient times."},
	{"name":"Paleontology", "field":"The scientific study of life existent prior to, and sometimes including, the start of the Holocene Epoch."},
	{"name":"Paleoornithology", "field":"The study of ancient and prehistoric birds and their evolution."},
	{"name":"Paleoosteology", "field":"The study of ancient bones."},
	{"name":"Paleopathology", "field":"The study of diseases in ancient humans."},
	{"name":"Paleopedology", "field":"The study of soils of past geological eras, from quite recent (Quaternary) to the earliest periods of the Earth's history."},
	{"name":"Paleophycology", "field":"The subdiscipline of paleobotany that deals with the study and identification of fossil algae and their evolutionary relationships and ecology."},
	{"name":"Paleophytology", "field":"The study of ancient plants and plant fossils; paleobotany."},
	{"name":"Paleotempestology", "field":"The study of past tropical cyclone activity by means of geological proxies as well as historical documentary records."},
	{"name":"Paleozoology", "field":"The branch of paleontology, paleobiology, or zoology dealing with the recovery and identification of organisms and the use of these fossils in the reconstruction of prehistoric environments and ancient ecosystems."},
	{"name":"Palynology", "field":"The study of dust, which more precisely includes contemporary and fossil palynomorphs, including pollen, spores, orbicules, dinocysts, acritarchs, chitinozoans and scolecodonts, together with particulate organic matter (POM) and kerogen found in sedimentary rocks and sediments."},
	{"name":"Pantheology", "field":"A branch of theology embracing all religions; a complete system covering all gods and religious systems."},
	{"name":"Papyrology", "field":"The study of ancient literature, correspondence, legal archives, etc., as preserved in manuscripts written on papyrus."},
	{"name":"Parapsychology", "field":"A field of study concerned with the investigation of paranormal and psychic phenomena which include telepathy, precognition, clairvoyance, psychokinesis, near-death experiences, reincarnation, apparitional experiences, and other paranormal claims."},
	{"name":"Parasitology", "field":"The study of parasites and how they interact with their hosts."},
	{"name":"Paroemiology", "field":"The study of proverbs."},
	{"name":"Parthenology", "field":"The study of virginity."},
	{"name":"Pathobiology", "field":"The branch of biology that deals with pathology with greater emphasis on the biological than on the medical aspects."},
	{"name":"Pathology", "field":"The study of abnormalities and diagonses"},
	{"name":"Pathophysiology", "field":"The physiological processes associated with disease or injury or study of it."},
	{"name":"Patrology", "field":"The study of the early Christian writers who are designated Church Fathers."},
	{"name":"Pedology", "field":"The study of soils in their natural environment."},
	{"name":"Pedology", "field":"The study of children's behavior and development."},
	{"name":"Pekingology", "field":"The study of the behavior of the government of the People's Republic of China."},
	{"name":"Pelology", "field":"The study of the therapeutic uses of mud."},
	{"name":"Penology", "field":"The study of the processes devised and adopted for the punishment and prevention of crime."},
	{"name":"Perinatology", "field":"A branch of medicine that focuses on managing health concerns of the mother and fetus prior to, during, and shortly after pregnancy; Maternal-fetal medicine."},
	{"name":"Periodontology", "field":"The specialty of dentistry that studies supporting structures of teeth, as well as diseases and conditions that affect them; periodontics."},
	{"name":"Personology", "field":"The assessment of a person's character or personality from outer appearance, especially the face."},
	{"name":"Pestology", "field":"The study of pests."},
	{"name":"Petrogeology", "field":"The study of origin, occurrence, movement, accumulation, and exploration of hydrocarbon fuels."},
	{"name":"Petrology", "field":"The branch of geology that studies the origin, composition, distribution and structure of rocks."},
	{"name":"Phaenology", "field":"The study of periodic plant and animal life cycle events and how these are influenced by seasonal and interannual variations in climate, as well as habitat factors (such as elevation)."},
	{"name":"Phagology", "field":"The study of habits related to eating or feeding."},
	{"name":"Phallology", "field":"The study of the penis."},
	{"name":"Phantasmology", "field":"The scientific study of spiritualistic manifestations and of apparitions."},
	{"name":"Phantomology", "field":"The study of supernatural beings."},
	{"name":"Pharmacoendocrinology", "field":"The pharmacology of endocrine function."},
	{"name":"Pharmacoenvironmentology", "field":"A branch of pharmacology and pharmacovigilance that deals entry of chemicals or drugs into the environment after elimination from humans and animals as post-therapy."},
	{"name":"Pharmacology", "field":"The branch of medicine and biology concerned with the study of drug action."},
	{"name":"Pharology", "field":"The scientific study of lighthouses and signal lights, their construction and illumination."},
	{"name":"Pharyngology", "field":"The scientific study of the pharynx and its diseases."},
	{"name":"Phenology", "field":"The study of periodic plant and animal life cycle events and how these are influenced by seasonal and interannual variations in climate, as well as habitat factors."},
	{"name":"Phenomenology", "field":"The science of phenomena as distinct from that of the nature of being."},
	{"name":"Pherology", "field":"The study of human carrying capacity of the Earth."},
	{"name":"Philematology", "field":"The science and study of kissing."},
	{"name":"Philology", "field":"The study of language in written historical sources."},
	{"name":"Phlebology", "field":"The medical specialty devoted to the diagnosis and treatment of venous disorders."},
	{"name":"Phonology", "field":"A branch of linguistics concerned with the systematic organization of sounds in languages."},
	{"name":"Phorology", "field":"The study of disease carriers and epidemic or endemic diseases."},
	{"name":"Photobiology", "field":"The scientific study of the interactions of light and living organisms."},
	{"name":"Photoecology", "field":"The study of or application of aerial photography to ecology and land management."},
	{"name":"Photogeology", "field":"The study or use of aerial photography to interpret geologic features."},
	{"name":"Photogeomorphology", "field":"The study or use of aerial photography to interpret geologic features."},
	{"name":"Photology", "field":"The study of light."},
	{"name":"Phraseology", "field":"The study of set or fixed expressions, such as idioms, phrasal verbs, and other types of multi-word lexical units (often collectively referred to as phrasemes)."},
	{"name":"Phrenology", "field":"A pseudomedicine primarily focused on measurements of the human skull, based on the concept that the brain is the organ of the mind, and that certain brain areas have localized, specific functions or modules."},
	{"name":"Phsychopharmacology", "field":"The scientific study of the effects drugs have on mood, sensation, thinking, and behavior."},
	{"name":"Phthisiology", "field":"The study of or the care, treatment, and study of tuberculosis of the lung."},
	{"name":"Phycology", "field":"The scientific study of algae."},
	{"name":"Physicology", "field":"The study of matter and its motion and behavior through space and time, along with related concepts such as energy and force; physics."},
	{"name":"Physiology", "field":"The study and description of natural objects."},
	{"name":"Physiopathology", "field":"The physiological processes associated with disease or injury."},
	{"name":"Phytobacteriology", "field":"The study and diagnosis of bacterial diseases of plants."},
	{"name":"Phytolithology", "field":"The study of fossil plants."},
	{"name":"Phytology", "field":"The study of plants; botany."},
	{"name":"Phytomorphology", "field":"The study of the physical form and external structure (morphology) of plants."},
	{"name":"Phytonematology", "field":"The study of plant nematodes."},
	{"name":"Phytopaleontology", "field":"The study of ancient plants and plant fossils."},
	{"name":"Phytopathology", "field":"The scientific study of diseases in plants."},
	{"name":"Phytopharmacology", "field":"The study of medicine from plant sources."},
	{"name":"Phytophenology", "field":"The study of phenology pertaining to plants."},
	{"name":"Phytophysiology", "field":"The study of the physiology of plants."},
	{"name":"Phytosociology", "field":"The branch of science which deals with plant communities, their composition and development, and the relationships between the species within them."},
	{"name":"Phytovirology", "field":"The study of plant viruses."},
	{"name":"Pimpology", "field":"The study or practice of pimping or being a pimp."},
	{"name":"Piscatology", "field":"The study, art, or science of fishing."},
	{"name":"Pisteology", "field":"The science or study of faith."},
	{"name":"Pistology", "field":"The branch of theology dealing with faith."},
	{"name":"Placentology", "field":"The study of the placenta."},
	{"name":"Planetology", "field":"The scientific study of planets (including Earth), moons, and planetary systems (in particular those of the Solar System) and the processes that form them."},
	{"name":"Plangonology", "field":"The study of dolls or the collection of dolls."},
	{"name":"Planktology", "field":"The study of plankton."},
	{"name":"Plutology", "field":"The study of wealth."},
	{"name":"Pneumatology", "field":"The study of spiritual beings and phenomena, especially the spiritual aspect of human beings and the interactions between humans and God."},
	{"name":"Pneumology", "field":"The study of the respiratory system and its organs."},
	{"name":"Pneumonology", "field":"The study of the respiratory system."},
	{"name":"Podology", "field":"The study of the feet."},
	{"name":"Poenology", "field":"The study of the processes devised and adopted for the punishment and prevention of crime."},
	{"name":"Pogonology", "field":"The study of beards."},
	{"name":"Polemology", "field":"The study of human conflict and war."},
	{"name":"Polychaetology", "field":"The study of worms belonging to the class Polychaete."},
	{"name":"Pomology", "field":"A branch of botany that studies and cultivates fruit."},
	{"name":"Ponerology", "field":"The study of evil."},
	{"name":"Posology", "field":"The study of the dosages of drugs, especially the determination of appropriate dosages."},
	{"name":"Potamology", "field":"The study of rivers."},
	{"name":"Praxeology", "field":"The deductive study of human action based on the notion that humans engage in purposeful behavior, as opposed to reflexive behavior."},
	{"name":"Primatology", "field":"The scientific study of primates."},
	{"name":"Proctology", "field":"The branch of medicine dealing with the pathology of and surgery upon the colon, rectum, and anus."},
	{"name":"Projectiology", "field":"The study of Out-of-body experiences."},
	{"name":"Promenadology", "field":"The science of strolling."},
	{"name":"Promorphology", "field":"The study of the organization of the egg especially with reference to localization of subsequently developed embryonic structures."},
	{"name":"Protistology", "field":"The scientific study of protists."},
	{"name":"Protoanthropology", "field":"The study of humans prior to the invention of writing."},
	{"name":"Protoarcheology", "field":"The study of prehistoric human artifacts and human fossils."},
	{"name":"Protozoology", "field":"The study of protozoa."},
	{"name":"Psephology", "field":"A branch of political science which deals with the study and scientific analysis of elections."},
	{"name":"Psychobiology", "field":"The study of the application of principles of biology to the study of physiological, genetic, and developmental mechanisms of behavior in humans and other animals."},
	{"name":"Psychology", "field":"The study of behavior and mind, embracing all aspects of conscious and unconscious experience as well as thought."},
	{"name":"Psychoneuroimmunology", "field":"The study of the interaction between psychological processes and the nervous and immune systems of the human body."},
	{"name":"Psychopathology", "field":"The scientific study of mental disorders."},
	{"name":"Psychophysiology", "field":"The branch of psychology that is concerned with the physiological bases of psychological processes."},
	{"name":"Psychosociology", "field":"The study of problems common to psychology and sociology, particularly the way individual behavior is influenced by the groups the person belongs to."},
	{"name":"Pteridology", "field":"The study of ferns and other pteridophytes."},
	{"name":"Pterylology", "field":"The branch of ornithology that studies the areas upon which birds grow feathers; pterylography."},
	{"name":"Ptochology", "field":"The study of pauperism or poverty."},
	{"name":"Pulmonology", "field":"The study of the respiratory system and its organs."},
	{"name":"Punnology", "field":"The art or practice of making puns or paronomasia."},
	{"name":"Pyramidology", "field":"The study of pseudoscientific speculations regarding pyramids."},
	{"name":"Pyretology", "field":"The study of fevers."},
	{"name":"Pyrgology", "field":"The study of towers."},
	{"name":"Pyritology", "field":"The study of pyrite or the pyrite group."},
	{"name":"Pyrology", "field":"The scientific study of the effects of heat or flame, often in regards to explosives or chemical compounds."},
	{"name":"Quinology", "field":"The science of the cultivation of cinchona and its use in medicine as quinine."},
	{"name":"Rabdology", "field":"The practice of performing arithmetic using Napier's bones named after a treatise by John Napier."},
	{"name":"Raciology", "field":"The study of races and ideas trying to justify the beliefs of racism, racialism, and other ideas of classifying individuals of different phenotypes into discrete races."},
	{"name":"Radarmeteorology", "field":"The study or use of radar in meteorology, especially to track water and ice in clouds."},
	{"name":"Radiobiology", "field":"The study of the effect of ionizing radiation on living things."},
	{"name":"Radioecology", "field":"The study of the effects of radiation and radioactive substances on ecological communities and natural ecosystems."},
	{"name":"Radiogeology", "field":"The study of the distribution of radioactive elements in the Earth's crust."},
	{"name":"Radiohydrology", "field":"The study of hydrology as used in the processing of radioactive materials."},
	{"name":"Radioimmunology", "field":"The study of immunology using antigens or antibodies labelled with radioisotopes."},
	{"name":"Radiology", "field":"A medical specialty that uses imaging to diagnose and treat diseases seen within the body."},
	{"name":"Reactology", "field":"The scientific study of psychological reactions."},
	{"name":"Redology", "field":"The academic study of Cao Xueqin's Dream of the Red Chamber, one of the Four Great Classical Novels of China."},
	{"name":"Reflexology", "field":"The study and interpretation of behavior in terms of simple and complex reflexes."},
	{"name":"Respirology", "field":"The study of diseases involving the respiratory tract."},
	{"name":"Rhabdology", "field":"The practice of performing arithmetic using Napier's bones named after a treatise by John Napier."},
	{"name":"Rhematology", "field":"The study of rhemes."},
	{"name":"Rheology", "field":"The study of the flow of matter."},
	{"name":"Rheumatology", "field":"The study of rheumatic disorders."},
	{"name":"Rhinology", "field":"The study of the nose, including the sinuses."},
	{"name":"Ribozymology", "field":"The study of ribozymes."},
	{"name":"Rickettsiology", "field":"The study of rickettsia."},
	{"name":"Ripperology", "field":"The study of Jack the Ripper, an unidentified serial killer."},
	{"name":"Roentgenology", "field":"The study or use of radiation in the treatment or diagnosis of disease; radiography."},
	{"name":"Rumorology", "field":"The study or practice of spreading rumours."},
	{"name":"Rumpology", "field":"The claimed ability to foretell the future by analyzing the characteristics of a person's buttocks."},
	{"name":"Runology", "field":"The study of the Runic alphabets, Runic inscriptions and their history."},
	{"name":"Saprobiology", "field":"The study of decaying organic matter and animals, saprophytes, that derive nutrients from it."},
	{"name":"Sarcology", "field":"The study of the soft parts of the body which include the studies: myology, angiology, neurology, and splanchnology."},
	{"name":"Satanology", "field":"The study of Satan."},
	{"name":"Scatology", "field":"The study of feces."},
	{"name":"Scelerology", "field":"The study of the sclera of the eye."},
	{"name":"Scolecology", "field":"The study of worms."},
	{"name":"Sedimentology", "field":"The study of natural sediments (silt, clay, and sand) and of the processes by which they are formed."},
	{"name":"Seismology", "field":"The scientific study of earthquakes and the propagation of elastic waves through the Earth or through other planet-like bodies."},
	{"name":"Selenology", "field":"The scientific study of the moon."},
	{"name":"Selenomorphology", "field":"The study of the lunar surface and landscape."},
	{"name":"Semantology", "field":"The study of the meaning of words."},
	{"name":"Semasiology", "field":"A discipline within linguistics concerned with the meaning of a word independent of its phonetic expression."},
	{"name":"Sematology", "field":"A branch of linguistics studying the meaning of words; semantics."},
	{"name":"Semiology", "field":"The study of signs."},
	{"name":"Senology", "field":"The branch of medicine that deals with disorders of the breast."},
	{"name":"Serology", "field":"The scientific study of serum and other bodily fluids."},
	{"name":"Serpentology", "field":"The study of snakes."},
	{"name":"Sexology", "field":"The scientific study of human sexuality, including human sexual interests, behaviors and functions."},
	{"name":"Siagonology", "field":"The study of jawbones."},
	{"name":"Sialosemeiology", "field":"The study and analysis of saliva in medical diagnoses."},
	{"name":"Sindhology", "field":"The study of the history, society, culture, and literature of Sindh, a province of Pakistan."},
	{"name":"Sindonology", "field":"The study of the Shroud of Turin."},
	{"name":"Sinology", "field":"The academic study of China primarily through Chinese language, literature, and history."},
	{"name":"Siphonapterology", "field":"The scientific study of fleas and other insects of the order Siphonaptera."},
	{"name":"Sitiology", "field":"The study of food, diet, and nutrition; dietetics."},
	{"name":"Sitology", "field":"The branch of medicine dealing with nutrition and dietetics."},
	{"name":"Skatology", "field":"The study of feces."},
	{"name":"Sociobiology", "field":"A field of scientific study that is based on the hypothesis that social behavior has resulted from evolution and attempts to explain and examine social behavior within that context."},
	{"name":"Socioecology", "field":"The scientific study of how social structure and organization are influenced by an organism's environment."},
	{"name":"Sociology", "field":"The study of society, human social interaction and the rules and processes that bind and separate people not only as individuals, but as members of associations, groups and institutions."},
	{"name":"Sociophysiology", "field":"An interdisciplinary field of research encompassing sociology and physiology that studies the physiological side of human interrelations."},
	{"name":"Somatology", "field":"The study or science of the human body's physical nature as a branch of anthropology."},
	{"name":"Somatotypology", "field":"The study of somatotypes."},
	{"name":"Somnology", "field":"The scientific study of sleep and related disorders."},
	{"name":"Sonology", "field":"The study of sound in a variety of disciplines."},
	{"name":"Sophiology", "field":"The science of ideas."},
	{"name":"Sophology", "field":"The study of wisdom."},
	{"name":"Soteriology", "field":"The study of religious doctrines of salvation."},
	{"name":"Sovietology", "field":"The study of politics and policies of the Soviet Union and former communist states."},
	{"name":"Spectrology", "field":"The study of the interaction between matter and electromagnetic radiation and the analysis of the electromagnetic spectrum."},
	{"name":"Speleology", "field":"The study of caves and other karst features."},
	{"name":"Spermology", "field":"The study of seeds."},
	{"name":"Sphagnology", "field":"The study of sphagnum moss."},
	{"name":"Sphygmology", "field":"The study of the pulse and its use in diagnosis of disease."},
	{"name":"Splanchnology", "field":"The study of the visceral organs."},
	{"name":"Splenology", "field":"The study of the spleen and its diseases and functions."},
	{"name":"Spongiology", "field":"The study of sponges (phylum Porifera)."},
	{"name":"Sporalogy", "field":"The study of predicting a persons future by analyzing the position of trams at the moment of a persons birth. (A parody of astrology by astronomer Nils Mustelin)."},
	{"name":"Stasiology", "field":"The study of political parties."},
	{"name":"Stemmatology", "field":"The study of multiple surviving versions of the same text with the aim of reconstructing a lost original."},
	{"name":"Stereology", "field":"The three-dimensional interpretation of two-dimensional cross sections of materials or tissues."},
	{"name":"Stichology", "field":"The study of poetic metres."},
	{"name":"Stigmeology", "field":"The art of punctuation."},
	{"name":"Stœchiology", "field":"Scientific study of bodily elements"},
	{"name":"Stomatology", "field":"The study of the mouth and nearby organs and their disorders."},
	{"name":"Storiology", "field":"The study of folklore and legends."},
	{"name":"Stringology", "field":"The study of algorithms and data structures used for processing text strings in programming and computing."},
	{"name":"Strollology", "field":"The science of strolling."},
	{"name":"Stromatology", "field":"The study of stratified rocks."},
	{"name":"Stygobiology", "field":"The study of stygofauna."},
	{"name":"Suicidology", "field":"The scientific study of suicidal behaviour and suicide prevention."},
	{"name":"Sumerology", "field":"The study of the ancient Sumerian civilization."},
	{"name":"Symbiology", "field":"The study of symbiosis."},
	{"name":"Symbology", "field":"The study of symbols."},
	{"name":"Symbolology", "field":"The study or use of symbols."},
	{"name":"Symptomatology", "field":"A set of symptoms characteristic of a medical condition or exhibited by a patient."},
	{"name":"Symptomology", "field":"A set of symptoms characteristic of a medical condition or exhibited by a patient."},
	{"name":"Synchronology", "field":"The systematic arrangement of synchronous or contemporaneous events."},
	{"name":"Syndesmology", "field":"The study of ligaments."},
	{"name":"Synechology", "field":"The theory of continuity or universal causation."},
	{"name":"Synecology", "field":"The ecological study of whole plant or animal communities."},
	{"name":"Synoecology", "field":"The study of relationships between species."},
	{"name":"Synosteology", "field":"The study of joints."},
	{"name":"Syphilology", "field":"The scientific study of the diagnosis and treatment syphilis."},
	{"name":"Systematology", "field":"The study of nature regarding the formation of systems."},
	{"name":"Systemology", "field":"The study of systems and the logic of systems."},
	{"name":"Tangutology", "field":"The study of the culture, history, art and language of the ancient Tangut people."},
	{"name":"Tartarology", "field":"The study of the underworld or doctrine pertaining to Hell."},
	{"name":"Taxology", "field":"The technique or study of identifying, naming, and classifying things; taxonomy."},
	{"name":"Tecnology", "field":"The study of children."},
	{"name":"Tectology", "field":"A Bogdanovian discipline that unified all social, biological and physical sciences by considering them as systems of relationships."},
	{"name":"Teleology", "field":"The philosophical study of nature by attempting to describe things in terms of their apparent purpose, directive principle, or goal."},
	{"name":"Teleseismology", "field":"The study of teleseisms or very distant seismic events."},
	{"name":"Telmatology", "field":"The branch of physical geography concerned with the study of wetlands, such as marshes or swamps."},
	{"name":"Tenontology", "field":"The study of tendons."},
	{"name":"Tephrochronology", "field":"A geochronological technique that uses discrete layers of tephra—volcanic ash from a single eruption—to create a chronological framework in which paleoenvironmental or archeological records can be placed."},
	{"name":"Teratology", "field":"The study of abnormalities of physiological development."},
	{"name":"Terminology", "field":"The study of terms and their use."},
	{"name":"Testaceology", "field":"The study of testaceous mollusks."},
	{"name":"Teuthology", "field":"A branch of malacology dealing with the study of cephalopods."},
	{"name":"Textology", "field":"The study of the production of texts."},
	{"name":"Thanatology", "field":"The scientific study of death."},
	{"name":"Thaumatology", "field":"The study of miracles."},
	{"name":"Theology", "field":"The study of god and religious ideas."},
	{"name":"Thereology", "field":"The science of healing and treatment of diseases; therapeutics."},
	{"name":"Theriogenology", "field":"A branch of veterninary medicine concerned with reproduction."},
	{"name":"Theriology", "field":"The study of mammals."},
	{"name":"Thermoecology", "field":"The branch of ecology that focuses on the effects of the temperature change."},
	{"name":"Thermology", "field":"The study of heat."},
	{"name":"Thermopathology", "field":"The branch of pathology that focuses on the effects of the temperature change."},
	{"name":"Therology", "field":"The study of mammals."},
	{"name":"Thracology", "field":"The scientific study of Ancient Thrace and Thracian antiquities."},
	{"name":"Thremmatology", "field":"The field of breeding or propagating plants and animals."},
	{"name":"Threpsology", "field":"The study of nutrition"},
	{"name":"Thymology", "field":"The study of those human aspects that precede or cause purposeful human behavior."},
	{"name":"Tibetology", "field":"The study of things related to Tibet, including its history, religion, language, politics and the collection of Tibetan articles of historical, cultural and religious significance."},
	{"name":"Tidology", "field":"The science or study of tides."},
	{"name":"Timbrology", "field":"The study of postage stamps; philately."},
	{"name":"Timology", "field":"The study of values or excellence."},
	{"name":"Tocology", "field":"The study of childbirth and obstetrics."},
	{"name":"Tokology", "field":"The study of childbirth and obstetrics."},
	{"name":"Tonology", "field":"The study of tone in human languages."},
	{"name":"Topology", "field":"The study of space and configuration"},
	{"name":"Toxicology", "field":"A branch of biology, chemistry, and medicine concerned with the study of the adverse effects of chemicals (poisons) on living organisms."},
	{"name":"Toxology", "field":"The study of projectiles and trajectories."},
	{"name":"Trachelology", "field":"The study of the neck and related injuries and disease."},
	{"name":"Transitology", "field":"The study of the process of change from one political regime to another."},
	{"name":"Traumatology", "field":"The study of trauma"},
	{"name":"Traumatopsychology", "field":"The study of psychologyical trauma."},
	{"name":"Treeology", "field":"The study of trees."},
	{"name":"Tribology", "field":"The study of science and engineering of interacting surfaces in relative motion."},
	{"name":"Trichology", "field":"The branch of dermatology that deals with the scientific study of the health of hair and scalp."},
	{"name":"Trilobitology", "field":"The study of trilobites."},
	{"name":"Trolleyology", "field":"An area of philosophy dealing with the kind of moral dilemma typified by the trolley problem."},
	{"name":"Trophology", "field":"The study of food combining."},
	{"name":"Truthology", "field":"The study of truth."},
	{"name":"Tsiganology", "field":"The study of gypsies."},
	{"name":"Tsiology", "field":"The study of or a treatise on tea."},
	{"name":"Turkology", "field":"The study of the languages, history, literature, folklore, culture, and ethnology of people speaking Turkic languages and Turkic peoples."},
	{"name":"Typhlology", "field":"The study of blindness."},
	{"name":"Typology", "field":"The study of types."},
	{"name":"Typtology", "field":"The study of spirit rapping, or the theory that spirits communicate with the living by tapping various codes."},
	{"name":"Ufology", "field":"The study of reports, visual records, physical evidence, and other phenomena related to unidentified flying objects (UFO)."},
	{"name":"Universology", "field":"The study and science of the universe."},
	{"name":"Uranology", "field":"The study of heavens."},
	{"name":"Urbanology", "field":"The branch of sociology that studies the problems of living in cities and towns."},
	{"name":"Uredinology", "field":"The study of rust molds."},
	{"name":"Urenology", "field":"The study of rust molds."},
	{"name":"Urinology", "field":"The study of urine and the urinary system."},
	{"name":"Urogynecology", "field":"A surgical sub-specialty of urology and gynecology."},
	{"name":"Urolithology", "field":"The study of the formation, composition, effects, and removal of urinary calculi."},
	{"name":"Urology", "field":"The branch of medicine that focuses on surgical and medical diseases of the male and female urinary tract system and the male reproductive organs."},
	{"name":"Uronology", "field":"The branch of medicine dealing with urine."},
	{"name":"Vaccinology", "field":"The study, development, and production of vaccines."},
	{"name":"Vaticanology", "field":"The study of the politics, decisions and functioning of the Vatican, Holy See, and Roman Catholic Church."},
	{"name":"Velology", "field":"The study and collection of vehicle tax discs."},
	{"name":"Venereology", "field":"The branch of medicine dealing with the study and treatment of sexually transmitted diseases."},
	{"name":"Venology", "field":"The study of veins."},
	{"name":"Vermeology", "field":"The study of worms."},
	{"name":"Vexillology", "field":"The study of the history, usage, and symbolism of flags."},
	{"name":"Victimology", "field":"The study of the victims of crime, and especially of the reasons why some people are more prone to be victims."},
	{"name":"Vietnamology", "field":"The study of Vietnam."},
	{"name":"Vinology", "field":"The study of wine and winemaking."},
	{"name":"Virology", "field":"The study of viruses."},
	{"name":"Vitaminology", "field":"The study of vitamins."},
	{"name":"Volcanology", "field":"The study of volcanoes, lava, magma, and related geological, geophysical and geochemical phenomena."},
	{"name":"Vulcanology", "field":"The study of volcanoes, lava, magma, and related geological, geophysical and geochemical phenomena."},
	{"name":"Vulvology", "field":"The study of the vulva."},
	{"name":"Woodpeckerology", "field":"The study of woodpeckers."},
	{"name":"Wordology", "field":"The study of words."},
	{"name":"Xenoarcheology", "field":"A fictional science, concerned with the physical remains of alien cultures."},
	{"name":"Xenobiology", "field":"The study of non-terrestrial life."},
	{"name":"Xenology", "field":"The study of alien life."},
	{"name":"Xenozoology", "field":"The branch of xenology dealing with extraterrestrial animals."},
	{"name":"Xylology", "field":"The study of wood."},
	{"name":"Zooarcheology", "field":"The study of animal remains at archeological sites."},
	{"name":"Zoogeology", "field":"The study of fossil animal remains."},
	{"name":"Zoology", "field":"The scientific study of the behavior, structure, physiology, classification, and distribution of animals."},
	{"name":"Zoonosology", "field":"The study of animal diseases."},
	{"name":"Zoopathology", "field":"The veterinary study specializing in the diagnosis of animal diseases through the examination of animal tissue and body fluids."},
	{"name":"Zoophysiology", "field":"The study of the physiology of animals."},
	{"name":"Zoophytology", "field":"The natural history of zoophytes."},
	{"name":"Zoopsychology", "field":"The study of psychology in animals."},
	{"name":"Zygology", "field":"The study of zygotes."},
	{"name":"Zymology", "field":"The science of or knowledge concerning fermentation."}
]}